/*
Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.

Внесената низа да се трансформира на начин што парните елементи ќе се зголемат за 1, а непарните ќе се намалат за 1.

Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со празно место меѓу нив.
*/
#include <stdio.h>

int main()
{
	int a[100];
	int n;
	scanf("%d", &n);

	for (int i = 0; i < n; i++)
		scanf("%d", &a[i]);

	for (int i = 0; i < n; i++)
		if (a[i] % 2 == 0)
			a[i]++;
		else
			a[i]--;

	for (int i = 0; i < n; i++)
		printf("%d ", a[i]);

	return 0;
}