/*
Од стандарден влез се чита цел број n. Потоа се вчитуваат n низи од цели броеви (со максимална должина од 100 елементи), при што за секоја прво се внесува должината на низата, а потоа сите елементи на низата, па на крај бројот k.

Да се напише програма која за секоја низа ќе ја трансформира истата, т.ш. за секој k-ти елемент ќе се направи замена на местата помеѓу него и неговиот претходник. Се смета дека важи k е најмалку 2.

На пример, ако е дадена следната низа:

1 2 3 4 5 6 7 8, за k=2 се добива

2 1 4 3 6 5 8 7
Да се испечатат сите трансформирани низи.
*/
#include <stdio.h>

int main()
{
	int a[100];
	int n;
	int m;
	int k;
	int z;
	scanf("%d", &n);

	for (int i = 0; i < n; i++)
	{
		scanf("%d", &m);

		for (int j = 0; j < m; j++)
			scanf("%d", &a[j]);

		scanf("%d", &k);

		for (int j = 0; j < m; j++)
			if ((j + 1) % k == 0)
			{
				z = a[j];
				a[j] = a[j - 1];
				a[j - 1] = z;
			}

		for (int j = 0; j < m; j++)
			printf("%d ", a[j]);

		printf("\n");
	}

	return 0;
}