/*
Да се напише рекурзивна функција која што прима еден аргумент број x која што ќе враќа 1 доколку секоја цифра во бројот е помала од предходната, а во спротивно 0.

Пример бројот 54321 е опаѓачки, додека пак бројот 54123 не е опаѓачки број.

Од стандарден влез се вчитува прво број N, а потоа N броеви. За секој број да се испечати 1 или 0 (во нов ред), доколку бројот е опаѓачки или не е опаѓачки.
*/
#include <stdio.h>

int func(int n)
{
	if (n < 10)
		return 1;

	if (n % 10 < n / 10 % 10)
		return func(n / 10);
	else
		return 0;
}

int main()
{
	int n;
	int a;
	scanf("%d", &n);

	for (int i = 0; i < n; i++)
	{
		scanf("%d", &a);

		if (func(a))
			printf("1\n");
		else
			printf("0\n");
	}
}