/*
Од стандарден влез се чита цел број К, по што се читаат N цели броеви. Да се напише програма која за секој прочитан број на стандарден излез ќе ги отпечати неговите цифри кои се поголеми од К, како и збирот на цифрите кои се отпечатени. Печатењето на цифрите поголеми од K да се реализира со посебна рекурзивна функција.

Пример: Доколку К = 5, за бројот 8423871 треба да се отпечати 887 : 23
*/
#include <stdio.h>

long long c;

void func(long long a, long long k)
{
	if (a != 0)
	{
		if (a % 10 > k)
		{
			c += a % 10;
			printf("%lld", a % 10);
		}
		func(a / 10, k);
	}
	else
	{
		printf(" : %lld\n", c);
		return;
	}
}

int main()
{
	long long a, n, k, b;
	scanf("%lld%lld", &k, &n);

	for (int i = 0; i < n; i++)
	{
		b = 0;
		scanf("%lld", &a);

		while (a != 0)
		{
			b *= 10;
			b += a % 10;
			a /= 10;
		}

		c = 0;
		func(b, k);
	}
}