/*
Напишете целосно рекурзивна функција triagolnik(n) што за даден влезен аргумент n ќе испечати на екран превртен триаголник од броевите од 1 до n, како во примерот подолу. Дополнителни функции се дозволени, но истите мора да се рекурзивни. Не е дозволено користење на циклуси!

Пример за n=4:

1 2 3 4 
1 2 3 
1 2 
1
*/
#include <stdio.h>

void func(int n, int i)
{
	if (i == n + 1)
	{
		i = 1;
		n -= 1;
		printf("\n");
	}
	if (n == 0)
		return;

	printf("%d ", i++);

	func(n, i);
}

int main()
{
	int n;
	int i = 1;
	scanf("%d", &n);
	func(n, i);
}