/*
Напишете целосно рекурзивна функција triagolnik(n) што за даден влезен аргумент n ќе испечати на екран триаголник од броевите од 1 до n. Дополнителни функции се дозволени, но истите мора да се исто така рекурзивни. Не е дозволено користење на циклуси!

Пример за n=4.

    1
    12
    123
    1234
*/
#include <stdio.h>

void func(int n, int i, int j)
{
	if (i > j)
	{
		j++;
		i = 1;
		printf("\n");
	}
	if (j > n)
		return;

	printf("%d", i++);

	func(n, i, j);
}

int main()
{
	int n;
	int i = 1;
	int j = 1;
	scanf("%d", &n);
	func(n, i, j);
}