/*
Продолжение на претходната задача:

Од стандарден влез најпрво се читаат информации за бројот на фискални сметки коишто ќе бидат скенирани М, а потоа се вчитуваат податоци за M фискални сметки, како во претходната задача.

На стандарден излез да се испечати повратокот на ДДВ за секоја од скенираните фискални сметки. На крајот да се испечати сумата на купените артикли на фискалната сметка со најголем повраток на ДДВ, како и повратокот на ДДВ за таа сметка.

Да се игнорираат фискалните сметки, коишто имаат сума на артиклите поголема од 30.000 денари и за истите да се испечати соодветна порака, како во тест примерите.
*/
#include <stdio.h>

int main()
{
	int a;
	char c;

	int n;
	int m;

	scanf("%d", &m);

	float d;
	int s;

	float f = 0;
	int e = 0;

	for (int i = 0; i < m; i++)
	{
		scanf("%d", &n);

		d = 0;
		s = 0;

		for (int j = 0; j < n; j++)
		{
			scanf("%d", &a);
			scanf("%c", &c);
			scanf("%c", &c);

			if (c == 'A')
			{
				d += a * 0.18;
				s += a;
			}
			else if (c == 'B')
			{
				d += a * 0.05;
				s += a;
			}
			else if (c == 'V')
				s += a;
		}

		if (s > 30000)
			printf("Sum %d is bigger than 30000\n", s);
		else
			printf("Total tax return is: %.2f\n", d * 0.15);

		if (f < d && s < 30000)
		{
			e = s;
			f = d;
		}

	}

	printf("Max amount of reciept: %d. Max tax return for reciepts: %.2f", e, f * 0.15);
	return 0;
}