/*
Да се напише програма во која се вчитува матрица (со димензии M и N, 1 < M,N <= 100) од цели броеви.

Сите елементи од матрицата се поставени на вредност 0 или 1.

Да се формира нова матрица така што на местото на сите елементи што имаат вредност 0, треба да се смести бројот на елементи со вредност 1 околу тој елемент во сите осум насоки.

Новодобиената матрица да се отпечати на стандарден излез, при што наместо елементите со вредност 1 од оригиналната матрица ќе се отпечати знак *.

Пример влез:

4 5
1 0 0 1 0
0 0 1 1 1
0 1 0 0 1
1 1 0 1 0
излез:

* 2 3 * 3
2 3 * * *
3 * 5 5 *
* * 3 * 2
*/
#include <stdio.h>

int main()
{
	int a[100][100];
	int b[100][100];
	int m, n, c;

	scanf("%d%d", &m, &n);

	for (int i = 0; i < m; i++)
		for (int j = 0; j < n; j++)
			scanf("%d", &a[i][j]);

	for (int i = 0; i < m; i++)

		for (int j = 0; j < n; j++)
			if (a[i][j] == 1)
				b[i][j] = -1;
			else if (a[i][j] == 0)
			{
				c = 0;
				for (int k = 0; k < 3; k++)
					if (a[i - 1][j - 1 + k] == 1)
						c++;
				if (a[i][j - 1] == 1)
					c++;
				if (a[i][j + 1] == 1)
					c++;
				for (int k = 0; k < 3; k++)
					if (a[i + 1][j - 1 + k] == 1)
						c++;

				b[i][j] = c;
			}

	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
			if (b[i][j] == -1)
				printf("* ");
			else
				printf("%d ", b[i][j]);
		printf("\n");
	}
}