//Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8). Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност се внесува од тастатура), да се најде и испечати најмалиот „благ број“. Ако не постои таков број, да се испечати NE.
#include <stdio.h>

int main()
{
	int a, b;
	scanf("%d%d", &a, &b);

	for (int i = a; i <= b; i++)
	{
		int c = i;
		while (c != 0)
		{
			if ((c % 10) % 2 == 0)
				c = c / 10;
			else
				break;
		}
		if (c == 0)
		{
			printf("%d", i);
			break;
		}
		if (i == b)
		{
			printf("NE");
		}
	}
	return 0;
}