//Од стандарден влез се чита еден природен број n. Меѓу природните броеви помали од n, да се најде оној чиј што збир на делителите е најголем. Во пресметувањето на збирот на делителите на даден број, да не се зема предвид самиот број.
#include <stdio.h>

int div(int n)
{
	int k = 1;
	for (int i = 2; i <= n / 2; i++)
		if (n % i == 0)
			k++;
	return k;
}

int main()
{
	int n, m = 0, k = 0;
	scanf("%d", &n);

	for (int i = 1; i < n; i++)
	{
		//printf("%d: %d\n", i, div(i));
		if (div(i) >= m)
		{
			m = div(i);
			k = i;
		}
	}

	printf("%d", k);
	return 0;
}