/*
Од стаднарден влез се читаат N низи од знаци (стрингови) не подолги од 80 знаци. На почетокот на програмата се читаат два цели броеви:

N - бројот на низи од знаци кои ќе се читаат и
X - поместување.
Секоја од вчитаните низи од знаци треба да се трансформира на тој начин што секоја од малите и големите букви (a-z, A-Z) се заменува со истата буква поместена X места понапред во азбуката (a-z). Ако се надмине опсегот на буквите во азбуката, се продолжува циклично од почетокот на азбуката. Трансформираната низа да се отпечати на СИ.

Трансформацијата да се имплементира со посебна рекурзивна функција.

Пример:

Welcome -> трансформирано со поместување 5 -> Bjqhtrj
*/
#include <stdio.h>
#include <malloc.h>
#include <ctype.h>
#include <string.h>

void func(char *str, int x)
{
    if (*str == '\0')
        return;

    if (islower(*str))
        if (*str + x > 'z')
            *str = (*str + x - 'a') % 26 + 'a';
        else
            *str += x;
    else if (isupper(*str))
        if (*str + x > 'Z')
            *str = (*str + x - 'A') % 26 + 'A';
        else
            *str += x;

    func(str + 1, x);
}

int main()
{
    int n, x;
    char *a = malloc(1000);

    scanf("%d %d", &n, &x);
    fgets(a, 1000, stdin);
    for (int i = 0; i < n; i++)
    {
        fgets(a, 1000, stdin);
        a[strlen(a) - 1] = '\0';

        func(a, x);

        printf("%s\n", a);
    }
}