/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.
*/
#include <stdio.h>

int main()
{
    int m, n;
    int i1, j1;
    int a[100][100];
    int b[2][2] = {0};

    scanf("%d%d", &m, &n);
    for (int i = 0; i < m; i++)
        for (int j = 0; j < n; j++)
            scanf("%d", &a[i][j]);
    scanf("%d%d", &i1, &j1);

    for (int i = 0; i < m; i++)
        for (int j = 0; j < n; j++)
        {
            if (i < i1 && j >= j1)
                b[0][1] += a[i][j];
            else if (i < i1 && j < j1)
                b[0][0] += a[i][j];
            else if (i >= i1 && j < j1)
                b[1][0] += a[i][j];
            else if (i >= i1 && j >= j1)
                b[1][1] += a[i][j];
        }

    printf("%d %d %d %d", b[0][1], b[0][0], b[1][0], b[1][1]);
}