/*
Од тастатура се внесуваат димензиите на една матрица (m, n <= 100), а потоа и елементите од матрицата. Да се генерира низа (со најмногу m) така што секој елемент од низата се добива со наоѓање на елементот во секоја редица од матрицата што е најоддалечен од аритметичката средина во рамки на таа редица. Ако постојат повеќе елементи што се најоддалечени од аритметичката средина, тогаш се зема предвид првиот. Редоследот на запишување на елементите во низата одговара на редоследот на редиците.

Пример:

Влез:

3 6

1 2 2 3 4 5

1 1 2 2 3 3

1 2 3 4 5 6

Излез:

5 1 1
*/
#include <stdio.h>
#include <math.h>
#include <stdlib.h>

int main()
{
	int m, n, sum, k;
	int a[100][100];
	int b[100];
	double max, avg;

	scanf("%d%d", &m, &n);
	for (int i = 0; i < m; i++)
		for (int j = 0; j < n; j++)
			scanf("%d", &a[i][j]);

	for (int i = 0; i < m; i++)
	{
		sum = 0;

		for (int j = 0; j < n; j++)
			sum += a[i][j];

		avg = (double) sum / n;
		max = fabs(avg - a[i][0]);
		k = 0;

		for (int j = 0; j < n; j++)
			if (max < fabs(avg - a[i][j]))
			{
				max = fabs(avg - a[i][j]);
				k = j;
			}

		b[i] = a[i][k];
	}

	for (int i = 0; i < m; i++)
		printf("%d ", b[i]);
}