/*
Дефинираме вредност d за тројка цели броеви a, b и c , така што таа се пресметува како сума меѓу апсолутните разлики од првиот и вториот број, од една страна, и вториот и третиот број, од друга страна:

d = |(a-b)| + |(b-c)|

Да се напише програма со којашто од тастатура се вчитуваат N тројки цели броеви (N се внесува од тастатура), и која што ја наоѓа и ја печати најмалата вредност за d од прочитаните тројки.

Пример:

Влез:

3

1 2 3

22 30 22

1 1 1

Излез:

0

Објаснување:

За тројката 1 2 3 вредноста d е: |(1-2)| + (2-3)| = 2

За тројката 22 30 22 вредноста d е: |(22-30)| + |(30-22)| = 16

За тројката 1 1 1 вредноста d е: |(1-1)| + |(1-1)| = 0

Најмала вредност d: 0
*/
#include <stdio.h>

int abs(int n)
{
	if (n >= 0)
		return n;
	else
		return -n;
}

int main()
{
	int n;
	int a, b, c;
	int d;
	int min;
	scanf("%d", &n);

	scanf("%d%d%d", &a, &b, &c);
	min = abs(a - b) + abs(b - c);

	for (int i = 0; i < n - 1; i++)
	{
		scanf("%d%d%d", &a, &b, &c);

		d = abs(a - b) + abs(b - c);

		if (min > d)
			min = d;
	}

	printf("%d", min);
}