/*
Во играта Бинго по редослед се извлекуваат непознат број броеви со вредности помеѓу 1 и 90. Секогаш се извлекуваат повеќе од 8 броја. Претпоставете дека внесувањето престанува кога ќе се внесе број кој не е во опсегот вредности.

Освен главната добивка, играчите играат и на џокер број. Џокер бројот се формира на следниот начин: Се слепуваат помалку значајните цифри од првите 7 извлечени броја, и на тој број се додаваат сите следни внесени броеви. Ваша задача е да го отпечатите така добиениот џокер број.
*/
#include <stdio.h>

int main()
{
	int n = 1;
	int d = 0;

	for (int i = 0; n > 0 && n < 90; i++)
	{
		scanf("%d", &n);

		if (i < 7)
			d = d * 10 + n % 10;
		else if (n > 0 && n < 90)
			d += n;
	}

	printf("%d", d);
}