/*
Во една компанија сите вработени користат еден централизиран систем, за кој им е креирана корисничка сметка. Корисничко име(username) на секој вработен се добива откако од матичниот број на вработениот ќе се земат деловите кои го даваат датумот на раѓање и ќе се пресмета вредноста:

ден * 100 + месец * 1000 + година
Така ако делот од матичниот број кој го дава датумот е 1103998, тогаш се добива 11 * 100 + 3 * 1000 + 1998 = 6098.

Доколку бројот кој ќе се добие по пресметката е петцифрен, тогаш тоа е корисничкото име.

Во спротивно, доколку е четирицифрен, тогаш се додава првата цифра да биде:

7 - доколку годината на раѓање е до 1960
8 - доколку годината на раѓање е помеѓу 1961 - 1980
9 - доколку годината на раѓање е помеѓу 1981 - 1999
Напомена: Се смета дека сите вработени се родени до 1999 година.

Програмата го враќа ваквото корисничко име за внес од тастатура кој е дел од матичниот број на некој вработен, како во примерот.
*/
#include <stdio.h>

int digits(int n)
{
	int c = 0;
	while (n != 0)
	{
		n /= 10;
		c++;
	}
	return c;
}

int num(int n)
{
	int c = (n / 100000) * 100 + (n / 1000 % 100) * 1000 + (n % 1000) + 1000;

	if (digits(c) == 5)
		return c;
	else if (n % 1000 <= 960)
		return c + 10000 * 7;
	else if (n % 1000 >= 961 && n % 1000 <= 980)
		return c + 10000 * 8;
	else if (n % 1000 >= 981 && n % 1000 <= 999)
		return c + 10000 * 9;
}

void cool(int n)
{
	printf("%d\n%d\n%d\n", (n / 100000) * 100, (n / 1000 % 100) * 1000, (n % 1000) + 1000);
}

int main()
{
	int a;
	scanf("%d", &a);

	printf("%d", num(a));
	//cool(a);
	return 0;
}