/*
Да се креира програма која што за вчитан датум од стандарден влез (во формат DD MM GGGG) ќе испечати на стандарден излез порака DA или NEво зависност од тоа дали внесениот датум е правилен или не.

При одредување на валидноста на датумот во предвид да се земат сите фактори:

дали месецот е број помеѓу 1 и 12
дали денот одговара со бројот на денови во тој месец
доколку е 29.02. да се внимава дали станува збор за престапна година
престапна година е секоја година која што е делива со 400 или пак е делива со 4, но не и со 100.
*/
#include <stdio.h>

int date(int a, int b, int c)
{
	if (a < 1 || a > 31)
		return 0;

	if (b < 1 || b > 12)
		return 0;

	if (b == 4 || b == 6 || b == 9 || b == 11)
		if (a == 31)
			return 0;

	if (b == 2)
	{
		if (a == 29)
		{
			//if (c % 4 == 0)
			if (c % 400 == 0 || (c % 4 == 0 && c % 100 != 0))
				return 1;
			else
				return 0;
		}
		else if (a > 28)
			return 0;
	}

	return 1;
}

int main()
{
	int a, b, c;
	scanf("%d%d%d", &a, &b, &c);
	if (date(a, b, c) == 1)
		printf("DA");
	else
		printf("NE");

	return 0;
}