//Да се напише програма каде од тастатура се внесува еден седумцифрен број. Програмата печати DA доколку бројот е специјален, а NE во спротивно. Еден број е специјален доколку за него важи дека е делив со својата прва цифра и не е делив со збирот на последните две или доколку не е делив со својата втора цифра и не е делив со збирот на последните две. Да се внимава на делење со 0, т.е. да се испечати порака Nevaliden broj во таков случај.
#include <stdio.h>

int div1(int n)
{
	if (n % 10 != 0 && ((n % 10 + n / 10 % 10) != 0))
		if (n % (n % 10) == 0 && n % (n % 10 + n / 10 % 10) != 0)
			return 1;
		else
			return 0;
	else
		return -1;
}

int div2(int n)
{
	if (n / 10 % 10 != 0 && ((n % 10 + n / 10 % 10) != 0))
		if (n % (n / 10 % 10) != 0 && n % (n % 10 + n / 10 % 10) != 0)
			return 1;
		else
			return 0;
	else
		return -1;
}

int main()
{
	int a;
	scanf("%d", &a);

	if (div1(a) == 0 && div2(a) == -1)
		printf("NE");
	else if (div1(a) == -1 || div2(a) == -1)
		printf("Nevaliden broj");
	else if (div1(a) == 1 || div2(a) == 1)
		printf("DA");
	else if (div1(a) == 0 || div2(a) == 0)
		printf("NE");


	return 0;
}